admbase/src/InformationRegisters/РазмещениеСотрудников/РазмещениеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазмещениеСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АдресРегистрации</name>
    <type>
      <types>CatalogRef.АдресаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Комната</name>
    <type>
      <types>CatalogRef.КомнатыВагоны</types>
    </type>
  </resources>
  <resources>
    <name>Место</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПроживания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗаселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыселения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументВыселения</name>
    <type>
      <types>DocumentRef.ПеремещениеСотрудников</types>
      <types>DocumentRef.ВыселениеСотрудников</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

admbase/src/CommonModules/ОбщежитиеФункцииСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Получить таблицу свободных мест.
// 
// Параметры:
//  Период - Дата
//  АдресРегистрации - СправочникСсылка.АдресаРегистрации
// 
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Получить таблицу свободных мест
Функция ПолучитьТаблицуСвободныхМест(Период) Экспорт
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	//Запрос.УстановитьПараметр("АдресРегистрации",АдресРегистрации);
	
#Область ТекстЗапроса

	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазмещениеСотрудниковСрезПоследних.Сотрудник,
	|	РазмещениеСотрудниковСрезПоследних.АдресРегистрации,
	|	РазмещениеСотрудниковСрезПоследних.Комната,
	|	РазмещениеСотрудниковСрезПоследних.Место,
	|	РазмещениеСотрудниковСрезПоследних.ДатаЗаселения,
	|	РазмещениеСотрудниковСрезПоследних.ДатаВыселения
	|ПОМЕСТИТЬ Занятые
	|ИЗ
	|	РегистрСведений.РазмещениеСотрудников.СрезПоследних(&Период, 
	//|АдресРегистрации = &АдресРегистрации
	|) КАК
	|		РазмещениеСотрудниковСрезПоследних
	|ГДЕ
	|	РазмещениеСотрудниковСрезПоследних.ДатаВыселения = ДАТАВРЕМЯ(1, 1, 1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК Место
	|ПОМЕСТИТЬ ПроизвольнаяНумерация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	11
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	12
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	13
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	14
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КомнатыВагоны.Владелец КАК АдресРегистрации,
	|	КомнатыВагоны.Ссылка КАК Комната,
	|	ПроизвольнаяНумерация.Место
	|ПОМЕСТИТЬ ВсеМеста
	|ИЗ
	|	Справочник.КомнатыВагоны КАК КомнатыВагоны
	|		ЛЕВОЕ соединение ПроизвольнаяНумерация КАК ПроизвольнаяНумерация
	|		По Истина
	|		и КомнатыВагоны.КоличествоМест >= Место
	|ГДЕ
	//|	КомнатыВагоны.Владелец = &АдресРегистрации
	//|	И 
	|КомнатыВагоны.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеМеста.АдресРегистрации,
	|	ВсеМеста.Комната,
	|	ВсеМеста.Место
	|ИЗ
	|	ВсеМеста КАК ВсеМеста
	|		ЛЕВОЕ соединение Занятые КАК Занятые
	|		по ВсеМеста.АдресРегистрации = Занятые.АдресРегистрации
	|		И ВсеМеста.Комната = Занятые.Комната
	|		И ВсеМеста.Место = Занятые.Место
	|Где
	|	Занятые.Место Есть NUll";
	
#КонецОбласти

	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
